kiruthick01/brute32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Wi-Fi driver must not persist its own state to NVS between captures
CONFIG_ESP_WIFI_NVS_ENABLED=n

# Custom partition table with a SPIFFS "storage" partition for captures
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ESP32-S3-N16R8: 16MB flash, 8MB embedded octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# esp_console REPL over UART is the control surface until the web UI lands
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

CONFIG_FREERTOS_HZ=1000

# NimBLE host, BLE-only controller mode (Phase 3)
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
